In [1]:
import pandas as pd
import pandasql as ps

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic['PassengerID']=range(1,1+len(titanic))

In [4]:
ps.sqldf("""SELECT *
            FROM titanic 
            LIMIT 5""")

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,PassengerID
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",2
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",3
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",4
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",5

## Analyse of Survived Passengers

#### Total survived:

In [5]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic
            WHERE survived=1  """)

   COUNT(*)
0       500

In [6]:
ps.sqldf(""" SELECT DISTINCT pclass
             FROM titanic  """)

   pclass
0     1.0
1     2.0
2     3.0
3     NaN

#### Survived from class 1:

In [7]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic
            WHERE pclass=1 AND survived=1  """)

   COUNT(*)
0       200

#### Survived from class 2:

In [8]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic
            WHERE pclass=2 AND survived=1  """)

   COUNT(*)
0       119

#### Survived from class 3:

In [9]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic
            WHERE pclass=3 AND survived=1  """)

   COUNT(*)
0       181

#### Survived from unknown class:

In [10]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic
            WHERE pclass is NULL AND survived=1  """)

   COUNT(*)
0         0

## Analyse of Classs:

Total passengers from class 1:

In [11]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE pclass=1  """)

   COUNT(*)
0       323

#### Total passengers from class 2:

In [12]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE pclass=2  """)

   COUNT(*)
0       277

#### Total passengers from class 3:

In [13]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE pclass=3  """)

   COUNT(*)
0       709

#### Total passengers from unknown class:

In [14]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE pclass is NULL""")

   COUNT(*)
0         1

## Analyse of sex:

Total Females:

In [15]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE sex= 'female'  """)

   COUNT(*)
0       466

#### Total males

In [16]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE sex= 'male'  """)

   COUNT(*)
0       843

#### Total survived females

In [17]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE sex= 'female' AND survived=1 """)

   COUNT(*)
0       339

#### Total survived males

In [18]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE sex= 'male' AND survived=1 """)

   COUNT(*)
0       161

## Analyse of Age

In [19]:
titanic=ps.sqldf(""" SELECT *,
                     CASE WHEN age is NULL THEN 'Missing'
                          WHEN age <18 THEN '1-17'
                      WHEN age <60 THEN '18-60'
                     ELSE '60+' 
                     END AS age_interval
                     FROM titanic """)

In [40]:
ps.sqldf(""" SELECT age, age_interval
             FROM titanic
             limit 10""")

       age age_interval
0  29.0000        18-60
1   0.9167         1-17
2   2.0000         1-17
3  30.0000        18-60
4  25.0000        18-60
5  48.0000        18-60
6  63.0000          60+
7  39.0000        18-60
8  53.0000        18-60
9  71.0000          60+

#### Passengers with missing age

In [21]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='Missing'  """)

   COUNT(*)
0       264

Survived:

In [22]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='Missing'  AND survived=1""")

   COUNT(*)
0        73

#### Passengers under 18

In [23]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='1-17'  """)

   COUNT(*)
0       154

Survived:

In [24]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='1-17'  AND survived=1""")

   COUNT(*)
0        81

#### Passengers between 18 and 60

In [25]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='18-60'  """)

   COUNT(*)
0       852

Survived:

In [26]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='18-60' AND survived=1 """)

   COUNT(*)
0       334

#### Passengers above 60

In [27]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='60+' """)

   COUNT(*)
0        40

Survived:

In [28]:
ps.sqldf("""SELECT COUNT(*)
            FROM titanic 
            WHERE age_interval='60+' AND survived=1 """)

   COUNT(*)
0        12

#### Oldest passanger

In [29]:
ps.sqldf("""SELECT passengerID, name, sex, survived, MAX(age) as age
            FROM titanic  """)

   PassengerID                                  name   sex  survived   age
0           15  Barkworth, Mr. Algernon Henry Wilson  male       1.0  80.0

#### Youngest passanger

In [30]:
ps.sqldf("""SELECT passengerID, name, sex, survived, MIN(age) as age
            FROM titanic  """)

,PassengerID,name,sex,survived,age
0,764,"Dean, Miss. Elizabeth Gladys ""Millvina""",female,1.0,0.1667

## Analyse of the Embarked

In [31]:
ps.sqldf("""SELECT DISTINCT embarked
            FROM titanic """)

  embarked
0        S
1        C
2     None
3        Q

In [32]:
# Survived passenger from embarked S
ps.sqldf(""" SELECT COUNT(*)
             FROM  titanic
             WHERE embarked= 'S' AND survived= 1""")

   COUNT(*)
0       304

In [33]:
# Survived passenger from embarked C
ps.sqldf(""" SELECT COUNT(*)
             FROM  titanic
             WHERE embarked= 'C' AND survived= 1""")

   COUNT(*)
0       150

In [34]:
# Survived passenger from embarked Q
ps.sqldf(""" SELECT COUNT(*)
             FROM  titanic
             WHERE embarked= 'Q' AND survived= 1""")

   COUNT(*)
0        44

In [35]:
# Survived passenger without embarked
ps.sqldf(""" SELECT COUNT(*)
             FROM  titanic
             WHERE embarked is NULL AND survived= 1""")

   COUNT(*)
0         2

In [36]:
ps.sqldf(""" SELECT COUNT(DISTINCT boat)
             FROM  titanic
             """)

   COUNT(DISTINCT boat)
0                    27

## Aggregating Information

In [38]:
ps.sqldf(""" SELECT  sex,
                     embarked,
                     survived,
                     AVG(age) AS avg_age,
                     MIN(age) AS min_age,
                     MAX(age) AS max_age,
                     COUNT(PassengerID) AS total_passengers,
                     COUNT(DISTINCT ticket) as unique_tickets
             FROM titanic
             GROUP BY embarked,sex,survived
             ORDER BY total_passengers DESC
""")

,sex,embarked,survived,avg_age,min_age,max_age,total_passengers,unique_tickets
0,male,S,0.0,30.855829,0.3333,74.0,517,456
1,female,S,1.0,29.104167,0.1667,76.0,198,148
2,male,C,0.0,35.178082,6.0000,71.0,109,101
3,male,S,1.0,25.712862,0.6667,80.0,106,95
4,female,C,1.0,31.543956,0.7500,64.0,102,69
5,female,S,0.0,24.842105,1.0000,63.0,93,65
6,male,Q,0.0,32.104167,2.0000,70.5,56,51
7,male,C,1.0,29.912602,0.4167,60.0,48,44
8,female,Q,1.0,24.000000,15.0000,37.0,37,34
9,female,Q,0.0,26.692308,17.0000,39.0,23,23
10,female,C,0.0,27.071429,9.0000,50.0,11,8
11,male,Q,1.0,25.000000,21.0000,29.0,7,7
12,female,None,1.0,50.000000,38.0000,62.0,2,1
13,None,None,NaN,NaN,NaN,NaN,1,0